IDENTIFICATION DIVISION.
PROGRAM-ID. CRE-SYS-FI.
ENVIRONMENT DIVISION.
  INPUT-OUTPUT SECTION.
    FILE-CONTROL.

      COPY "SLVND02.CBL".
      COPY "SLCHK01.CBL".
      COPY "SLBILL01.CBL".
      COPY "SLSTATE.CBL".
      COPY "SLCONTRL.CBL".
      COPY "SLVOUCH.CBL".

DATA DIVISION.
  FILE SECTION.

      COPY "FDVND02.CBL".
      COPY "FDCHK01.CBL".
      COPY "FDBILL01.CBL".
      COPY "FDSTATE.CBL".
      COPY "FDCONTRL.CBL".
      COPY "FDVOUCH.CBL".
   
PROCEDURE DIVISION.

*> create the files
*>  ----------------------------
      OPEN OUTPUT VENDOR-FILE.   
      OPEN OUTPUT CHECK-FILE. 
      OPEN OUTPUT BILL-FILE.
      OPEN OUTPUT STATE-FILE.
      OPEN OUTPUT VOUCHER-FILE.

      OPEN OUTPUT CONTROL-FILE.
      PERFORM CREATE-1-RECORD-ON-CONTROL-FILE.

      CLOSE VENDOR-FILE.
      CLOSE CHECK-FILE. 
      CLOSE BILL-FILE.
      CLOSE STATE-FILE.
      CLOSE VOUCHER-FILE.

      CLOSE CONTROL-FILE.

      STOP RUN.

*>  ----------------------------
CREATE-1-RECORD-ON-CONTROL-FILE.

      MOVE 1 TO CONTROL-KEY.
      MOVE 0 TO CONTROL-LAST-VOUCHER.

      WRITE CONTROL-RECORD
         INVALID KEY
            DISPLAY "*** ERROR WRITING CONTROL-FILE RECORD !!! ***".



