*>----------------------------------------------------
*> These procedures are used by:
*>   
*>     PLGENERAL.CBL
*>     bill-processing-system.cob
*>     payment-mode.cob
*>_________________________________________________________________________

CLEAR-SCREEN.
PERFORM JUMP-LINE 25 TIMES.
*>_________________________________________________________________________

JUMP-LINE.
DISPLAY " ".
*>_________________________________________________________________________

