*>--------------------------------
*> wscase01.cbl,
*> Can be used for case conversion
*> Ex:  INSPECT data-field
*>     CONVERTING LOWER-ALPHA
*>             TO UPPER-ALPHA.
*>--------------------------------

   77 UPPER-ALPHA PIC X(26) 
            VALUE "ABCDEFGHIJKLMNOPQRSTUVWXYZ".
   77 LOWER-ALPHA PIC X(26) 
            VALUE "abcdefghijklmnopqrstuvwxyz".

